{
  "Обо мне": "Обо мне",
  "Контакты": "Контакты",
  "Навыки": "Навыки и Технологии",
  "Проекты": "Проекты",
  "Язык": "En",
  "Курсы": "Курсы",
  "Свет": "Свет",
  "Тень": "Тень",
  "aboutGreetings": "Привет! 👋",
  "aboutTitle": "Я Никита Трохов - Frontend Разработчик",
  "aboutText": "Разрабатываю Web - приложения на JavaScript / Typescript / Reactjs / Nodejs с использованием различных библиотек и технологий.",
  "Nikita Trokhov": "Никита Трохов",
  "STACK": "СТЕК",
  "Демо": "Демо",
  "Git": "Открыть проект в Git",
  "OnlineBlogsDesc": "Информационное сообщество, где любой желающий может опубликовать пост на выбранную тему. Написано на Typescript / React. Использовались различные виды тестирований (unit, RTL, E2E, Скриншотное тестирование). Lazy-loading. Для каждого компонента описывается Storybook. Используется библиотека i18next для работы с переводами. Написан в соответствии с методологией Feature-Sliced Design.",
  "FastCompanyDesc": "Клиент-серверное приложение для знакомств. Написано на Javascript / React / Nodejs. На фронтенде реализованы возможности добавления в избранное, комментирования профилей, сортировка, пагинация и т.д. На бекенде используется база MongoDB, для авторизации JWT-Tokens.",
  "OnlineStoreDesc": "Универсальный онлайн-магазин с админ-панелью и возможностью создавать собственные категории и наполнять их товарами, а также редактировать и удалять их со стороны администратора. Написано на Javascript / React / Nodejs. На бекенде используется база MongoDB, для авторизации JWT-Tokens, ограничения по ролям на стороне бекенда.",
  "PortfolioDesc": "Персональное портфолио разработчика с функциями переключения светлой/темной темы и интернационализацией. Архитектура приложения выстроена на основе Feature-Sliced Design.",
  "EslintPluginDesc": "Собственный Eslint plugin, имеет три опции проверки: 1. запрещает абсолютный импорт внутри одного модуля; 2. проверяет, правильно ли используются слои с точки зрения Feature-Sliced Design (например, виджеты нельзя использовать в features и entities); 3. разрешает импорт из других модулей только из публичного API. Имеет автоматическое исправление.",
  "CurrencyConverterDesc": "Конвертер валют, который позволяет запрашивать актуальные курсы обмена. В приложении также реализована валидация вводимых данных и отображение таблицы с курсами. Чтобы обеспечить сохранение данных, использован механизм local storage для запоминания введенной суммы и выбранных валют.",
  "Страница не найдена": "Страница не найдена"
}
