{
  "Обо мне": "About",
  "Контакты": "Contacts",
  "Навыки": "Skills and Tools",
  "Проекты": "Projects",
  "Язык": "Ру",
  "Курсы": "Courses",
  "Свет": "Light",
  "Тень": "Dark",
  "aboutGreetings": "Hi! 👋",
  "aboutTitle": "I'm Nikita Trokhov - Frontend Developer",
  "aboutText": "Having an experience of building Web apps with JavaScript / Typescript / Reactjs / Nodejs and some other cool libraries.",
  "Nikita Trokhov": "Nikita Trokhov",
  "STACK": "STACK",
  "Демо": "Demo",
  "Git": "Open in Git",
  "OnlineBlogsDesc": "An informative community where anyone can publish a post on a topic of their choice. Written in Typescript / React. Various types of testing were used (unit, RTL, E2E, screenshot testing). Lazy-loading. Storybook described for each component. Used i18next library to work with translations. Written according to the Feature-Sliced Design methodology.",
  "FastCompanyDesc": "Client-server dating application. Written in Javascript / React / Nodejs. The frontend features adding to favorites, commenting on profiles, sorting, pagination, etc. The backend uses MongoDB, JWT-Tokens for authorization.",
  "OnlineStoreDesc": "Universal online store with an admin panel and the ability to create your own categories and fill them with products, as well as edit and delete them from the admin side. Written in Javascript / React / Nodejs. The backend uses a MongoDB database, JWT-Tokens for authorization, role restrictions on the backend side.",
  "PortfolioDesc": "Personalized developer portfolio with light/dark theme switching and internationalization features. The architecture of the application is based on Feature-Sliced Design.",
  "EslintPluginDesc": "Eslint's own plugin, has three check options: 1. prohibits absolute import within a single module; 2. checks if layers are used correctly in terms of Feature-Sliced Design (for example, widgets cannot be used in features and entities); 3. allows import from other modules only from the public API. Has an automatic fix."
}
